import '../style/Modules/UserAgreement.scss';

function UserAgreement() {
    return (
        <>
            <div className="userAgreement">
                <h2>用户协议</h2>
                <p>欢迎使用我们的服务</p>
                本协议是您（以下简称“用户”）与 SouthAki_Edge©2021 组织（以下简称“我们”）之间关于使用 LLM情报机器人（以下简称“本服务”）所订立的协议。请您仔细阅读本协议内容。一旦您访问或使用本服务，即视为您已同意本协议的全部内容。

                <p>第一条 服务说明</p>
                本服务由 SouthAki_Edge©2021 组织 提供，旨在 开发人人都能受益的通用型人工智能。
                用户在使用本服务时应自行准备相关设备及网络连接，且由用户承担相关费用。
                <p>第二条 用户账户</p>
                账户注册
                用户需提供真实、合法、有效的信息进行注册，并维护账户信息的准确性。
                账户安全
                用户需妥善保管账户信息及密码，并对通过其账户所进行的所有活动和行为负责。
                <p>第三条 用户行为规范</p>
                用户在使用本服务时不得实施以下行为：

                违反法律法规或本协议的行为；
                发布、传输违法、骚扰、诽谤或侵害他人权益的内容；
                试图未经授权访问本服务的系统或数据；
                利用本服务进行任何形式的商业活动，未经我们许可。
                如用户违反上述规定，我们有权采取暂停或终止服务等措施，且保留追究法律责任的权利。

                <p>第四条 隐私保护</p>
                我们承诺依法保护用户的个人信息。除非取得用户授权或法律法规另有规定，我们不会向第三方披露用户信息。
                用户需妥善保护自己的账户及个人信息，不得向任何人泄露账户密码。
                <p>第五条 知识产权</p>
                本服务的所有内容，包括但不限于文字、图片、音频、视频、软件、技术等，均归 SouthAki_Edge©2021 组织 或相关权利人所有，受法律保护。
                用户不得擅自复制、传播或用于商业用途。
                <p>第六条 责任限制</p>
                本服务可能因以下情形暂时中断，我们对此不承担责任：

                系统维护或升级；
                设备故障或其他不可抗力；
                用户自身的网络问题。
                我们将尽力保障服务的稳定性，但对因上述情形导致的服务中断或数据损失不承担赔偿责任。

                <p>第七条 协议变更与终止</p>
                我们有权根据需要对本协议进行修订，并通过公告或其他合理方式通知用户。修订后的协议自公布之日起生效。
                用户如不同意修订后的协议内容，应立即停止使用本服务。
                <p>第八条 法律适用与争议解决</p>
                本协议适用中华人民共和国法律。
                因本协议引起的争议，双方应协商解决；协商不成的，任何一方可向 广东省广州市白云区 的人民法院提起诉讼。
                <p>第九条 其他</p>
                本协议标题仅为方便阅读，不影响条款内容的含义。
                如本协议的部分条款因任何原因被认定为无效或不可执行，其余条款仍然有效。
                感谢您使用我们的服务！
                <div className='copyright'>SouthAki_Edge©2021 组织致上</div>
                <div>联系方式xieleihan@southaki.cn</div>
                <div>修订日期:2024.12.10</div>
            </div>
        </>
    )
}

export default UserAgreement;